#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ssm_parameter.infra_output: Reading...
data.aws_caller_identity.current: Reading...
aws_codedeploy_app.application_main: Refreshing state... [id=b326775b-2c4f-418c-afe6-c643eafbbc4b:app-6]
aws_iam_role.codedeploy_role: Refreshing state... [id=app-6-code-deploy-role]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-6-task-execution-role]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-6-task-role]
data.aws_ssm_parameter.infra_output: Read complete after 1s [id=/app-6/output]
aws_iam_policy.secrets_manager_read_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-6-task-execution-role-20241003153209502800000001]
aws_iam_role_policy_attachment.attach_secrets_read_task_execution_role: Refreshing state... [id=app-6-task-execution-role-20241003153209508300000002]
aws_iam_role_policy_attachment.codedeploy_policy_attachement: Refreshing state... [id=app-6-code-deploy-role-20241006015657334100000001]
aws_iam_role_policy_attachment.attach_secrets_read_task_role: Refreshing state... [id=app-6-task-role-20241003153209524100000003]
aws_iam_policy.custom_codedeploy_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-code-deploy-policy]
aws_ecs_task_definition.web_app: Refreshing state... [id=app-6]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6]
aws_codedeploy_deployment_group.application_main: Refreshing state... [id=664c9ff4-b726-4afb-9654-85030ab22491]
local_file.code_deploy_sh: Refreshing state... [id=b15436ff24f0caa1a1d39925b90d288e94c4f469]
null_resource.code_deploy: Refreshing state... [id=4032747766715569796]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:68" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-6" -> (known after apply)
      ~ revision                 = 68 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.code_deploy_sh will be created
  + resource "local_file" "code_deploy_sh" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0755"
      + filename             = "./code_deploy.sh"
      + id                   = (known after apply)
    }

  # null_resource.code_deploy must be replaced
-/+ resource "null_resource" "code_deploy" {
      ~ id       = "4032747766715569796" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_content" = <<-EOT
                #!/bin/bash
                set -e
                
                echo "Starting CodeDeploy agent deployment"
                aws --version
                
                echo "Constructing deployment command..."
                COMMAND=$(cat <<EOT
                aws deploy create-deployment \
                    --application-name "app-6" \
                    --deployment-config-name CodeDeployDefault.ECSAllAtOnce \
                    --deployment-group-name "app-6-deploy-group" \
                    --revision '{"revisionType": "AppSpecContent", "appSpecContent": {"content": "{\"Resources\":[{\"TargetService\":{\"Properties\":{\"LoadBalancerInfo\":{\"ContainerName\":\"first\",\"ContainerPort\":8080},\"TaskDefinition\":\"arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:68\"},\"Type\":\"AWS::ECS::Service\"}}],\"version\":\"0.0\"}", "sha256":"b919d0df0b796940bc7a39dc40904cf09a7c0719e0d19388b54d92b53c3d8e00"}}' \
                    --description "Deployment from Terraform" \
                    --output json
                EOT
                )
                
                echo "Command to be executed:"
                echo "$COMMAND"
                
                echo "Executing deployment command..."
                DEPLOYMENT_INFO=$(eval "$COMMAND")
                COMMAND_EXIT_CODE=$?
                
                echo "Command exit code: $COMMAND_EXIT_CODE"
                echo "Raw output:"
                echo "$DEPLOYMENT_INFO"
                
                if [ $COMMAND_EXIT_CODE -ne 0 ]; then
                    echo "Error: AWS CLI command failed"
                    exit $COMMAND_EXIT_CODE
                fi
                
                echo "Parsing deployment info..."
                if ! DEPLOYMENT_ID=$(echo "$DEPLOYMENT_INFO" | jq -r '.deploymentId'); then
                    echo "Error: Failed to parse deployment ID from output"
                    exit 1
                fi
                
                if [ "$DEPLOYMENT_ID" == "null" ] || [ -z "$DEPLOYMENT_ID" ]; then
                    echo "Error: Deployment ID is null or empty"
                    exit 1
                fi
                
                echo "Deployment ID: $DEPLOYMENT_ID"
                
                echo "Deployment created successfully"
            EOT -> (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*